app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" ORDER BY "pets"."id" DESC
---
	def index
		@pets = Pet.all.order(id: :asc)

INSERT INTO "pets" ("name", "post_type", "animal", "breed", "age", "description", "user_id", "created_at", "updated_at", "picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
	def create
		@pet = Pet.new(pet_params)
		@pet.user = current_user
		if @pet.save

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@pet = Pet.find(params[:id])

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "pets" SET "picture_file_name" = $1, "picture_content_type" = $2, "picture_file_size" = $3, "picture_updated_at" = $4, "updated_at" = $5 WHERE "pets"."id" = $6
---
	def update
		@pet = Pet.find(params[:id])
		if @pet.update(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 8]]
---
	def destroy
		@pet = Pet.find(params[:id])
		@pet.delete