app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."user_id" = $1 ORDER BY "pets"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def index
    @users = User.all
    @pets = current_user.pets.order(id: :desc)

INSERT INTO "users" ("username", "password_digest", "f_name", "l_name", "address", "city", "state", "zip", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @user = User.new(create_params)

    if @user.save

UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "danwoohoo"], ["password_digest", "$2a$10$DpKdKBgBWtrV2VTZwgtWoeHJZW8/1Xc.PiKOPzwciSYzt07fAJLZe"], ["updated_at", "2018-01-13 04:34:32.514687"], ["id", 1]]
---
  def update
    @user = current_user
    if @user.update(create_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
SELECT  "pets".* FROM "pets" WHERE "pets"."user_id" = $1 ORDER BY "pets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def destroy
    @user = User.find(params[:id])
    list = @user.pets
    list.each { |f| f.delete }